#include "delay.h"
#include "type.h"
#include "sconfig.h"
#include"intrins.h"

/*********************************************************************************************
函数名：微秒级CPU延时函数
调  用：delay (?);
参  数：1~65535（参数不可为0）
返回值：无

/*********************************************************************************************/
void delay(unsigned int t) {
	while(t--);
	return;
}

/*********************************************************************************************
函数名：毫秒级CPU延时函数
调  用：delay_ms (?);
参  数：1~65535（参数不可为0）
返回值：无
结  果：占用CPU方式延时与参数数值相同的毫秒时间
备  注：应用于1T单片机时i<600，应用于12T单片机时i<125
/*********************************************************************************************/
void delay_ms(unsigned int t) {
	unsigned int i,j;
	for(i=0;i<t;i++) {
		for(j=0;j<600;j++);
	}	
	return;
}
/*********************************************************************************************
函数名：微秒级CPU延时函数
调  用：delay (?);
参  数：1~65535（参数不可为0）
返回值：无

/*********************************************************************************************/
void delay_us(void)  
{
   _nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_();
	_nop_();
	_nop_();
	_nop_();
}